In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Category": ["Fruit", "Fruit", "Vegetable", "Vegetable", "Fruit"],
    "Item": ["Apple", "Banana", "Carrot", "Potato", "Mango"],
    "Price": [100, 40, 30, 20, 60],
    "Quantity": [5, 7, 3, 4, 6]
})

print(df)

    Category    Item  Price  Quantity
0      Fruit   Apple    100         5
1      Fruit  Banana     40         7
2  Vegetable  Carrot     30         3
3  Vegetable  Potato     20         4
4      Fruit   Mango     60         6

In [3]:
#Total price for each category
#df.groupby("Category")["Price"].sum()
df.groupby("Category")[["Price","Quantity"]].sum()

           Price  Quantity
Category
Fruit        200        18
Vegetable     50         7

In [4]:
#Average quantity for each category
df.groupby("Category")["Quantity"].mean()

Category
Fruit        6.0
Vegetable    3.5
Name: Quantity, dtype: float64

In [5]:
#Multiple aggregations at once
df.groupby("Category").agg({
    "Price":["sum","max","min"],
    "Quantity":["sum","mean","median"]
})

          Price          Quantity
            sum  max min      sum mean median
Category
Fruit       200  100  40       18  6.0    6.0
Vegetable    50   30  20        7  3.5    3.5

In [6]:
df["Price"].mode().iloc[3]

np.int64(60)

In [7]:
#for mode opreation
df.groupby("Category")["Price"].apply(lambda x: x.mode().iloc[0])

Category
Fruit        40
Vegetable    20
Name: Price, dtype: int64

In [8]:
#if you want the full list of modes per group
df.groupby("Category")["Price"].apply(lambda x: list(x.mode()))

Category
Fruit        [40, 60, 100]
Vegetable         [20, 30]
Name: Price, dtype: object

In [9]:
df["Quantity"].median()

5.0

In [10]:
df2=pd.DataFrame({
    "City":["Delhi","Delhi","Delhi","Mumbai","Mumbai","Mumbai"],
    "Product":["Shoes","Shoes","Watch","Shoes","Watch","Watch"],
    "Sales":[200,150,300,400,250,300]
})
df2

     City Product  Sales
0   Delhi   Shoes    200
1   Delhi   Shoes    150
2   Delhi   Watch    300
3  Mumbai   Shoes    400
4  Mumbai   Watch    250
5  Mumbai   Watch    300

In [11]:
#Total sales of Shoes in each city
citydf=df2.groupby("City")["Sales"].sum()
citydf

City
Delhi     650
Mumbai    950
Name: Sales, dtype: int64

In [12]:
# Total sales of Watch in each city
prodf=df2.groupby("Product")["Sales"].sum()
prodf

Product
Shoes    750
Watch    850
Name: Sales, dtype: int64

In [13]:
pd.concat([citydf,prodf]) #to solve this pivotTables used

Delhi     650
Mumbai    950
Shoes     750
Watch     850
Name: Sales, dtype: int64

In [17]:
result = df2.groupby(["Product", "City"])["Sales"].sum()
result = result.unstack(fill_value=0)
print(result)

City     Delhi  Mumbai
Product
Shoes      350     400
Watch      300     550

In [18]:
g = df2.groupby([ "City","Product"])["Sales"].sum().unstack()
print(g)

Product  Shoes  Watch
City
Delhi      350    300
Mumbai     400    550